--------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  pyelw/tests/stata_whittle.log
  log type:  text
 opened on:  18 Aug 2025, 13:29:03

.
. clear all

. insheet using ../data/nile.csv
(2 vars, 663 obs)

. tsset year, yearly
        time variable:  year, 0622 to 1284
                delta:  1 year

. whittle nile, powers(0.4 0.5 0.6 0.7 0.8 0.9)
------------------------------------------------------------
    N   Power  Trunc   Est d      StdErr    Asy.StdErr
------------------------------------------------------------
   663  0.40    13    .538433     .1806     .1387
   663  0.50    25    .466848     .1139        .1
   663  0.60    49    .459277    .07914    .07143
   663  0.70    94    .385763    .05091    .05157
   663  0.80   180    .376356    .03674    .03727
   663  0.90   346    .366238    .02649    .02688
------------------------------------------------------------

. whittle nile, powers(0.4 0.5 0.6 0.7 0.8 0.9) exact
------------------------------------------------------------
    N   Power  Trunc   Est d      StdErr    Asy.StdErr
------------------------------------------------------------
   663  0.40    13    .523264     .1717     .1387
   663  0.50    25    .453753     .1106        .1
   663  0.60    49    .450481    .07844    .07143
   663  0.70    94    .392375    .05216    .05157
   663  0.80   180    .408864    .04007    .03727
   663  0.90   346    .542664    .04032    .02688
------------------------------------------------------------

.
. clear all

. insheet using ../data/sealevel.csv
(6 vars, 1,558 obs)

. gen date = monthly(datevec, "YM")

. format date %tm

. tsset date
        time variable:  date, 1880m1 to 2009m10
                delta:  1 month

. whittle sea, powers(0.6 0.65 0.7 0.75 0.8)
------------------------------------------------------------
    N   Power  Trunc   Est d      StdErr    Asy.StdErr
------------------------------------------------------------
  1558  0.60    82    .932228    .05769    .05522
  1558  0.65   118    .859211    .04384    .04603
  1558  0.70   171    .854608    .03705    .03824
  1558  0.75   247    .854038    .03113    .03181
  1558  0.80   358    .898448    .02806    .02643
------------------------------------------------------------

. whittle sea, powers(0.6 0.65 0.7 0.75 0.8) exact
------------------------------------------------------------
    N   Power  Trunc   Est d      StdErr    Asy.StdErr
------------------------------------------------------------
  1558  0.60    82    .888921    .04535    .05522
  1558  0.65   118    .801612    .03494    .04603
  1558  0.70   171    .773669    .02987    .03824
  1558  0.75   247    .784673    .02743    .03181
  1558  0.80   358    .881789    .03067    .02643
------------------------------------------------------------

.
. log close
      name:  <unnamed>
       log:  pyelw/tests/stata_whittle.log
  log type:  text
 closed on:  18 Aug 2025, 13:29:04
--------------------------------------------------------------------------------------------------------------------------
